===================
add two integers (both literals)
===================

var x = 1 + 2;

---
(module
  (variable_declaration (identifier)
    (operator)
    (integer) (operator) (integer))
)

===================
add two strings (both literals)
===================

var x = "a" + "b";

---
(module
  (variable_declaration (identifier)
    (operator)
    (string) (operator) (string))
)


===================
add three integers (all literals)
===================

var x = 1 + 2 + 3;

---
(module
  (variable_declaration (identifier)
    (operator)
    (integer)
    (operator)
    (integer)
    (operator)
    (integer)
  )
)



===================
add two integers, one is a variable
===================

var y = 1;
var x = 1 + y;

---
(module
  (variable_declaration (identifier) (operator) (integer))
  (variable_declaration (identifier) (operator)
    (integer) (operator) (identifier)
  )
)
