===================
Empty Package Name
===================

package;

---

(module (package_statement))

===================
Package Name
===================

package my;

---

(module (package_statement (package_name)))

===================
Package Name with single path
===================

package my.other;

---

(module
  (package_statement
    (package_name)
    (package_name)
  )
)

===================
Package Name with path
===================

package my.other.package;

---

(module
  (package_statement
    (package_name)
    (package_name)
    (package_name)
  )
)
